tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_clb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_3 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_3_IN0_S    0U
#define CLB_OUTPUT_LUT_3_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_3_IN1_S    5U
#define CLB_OUTPUT_LUT_3_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_3_IN2_S    10U
#define CLB_OUTPUT_LUT_3_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_3_FN_S     15U
#define CLB_OUTPUT_LUT_3_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_4 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_4_IN0_S    0U
#define CLB_OUTPUT_LUT_4_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_4_IN1_S    5U
#define CLB_OUTPUT_LUT_4_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_4_IN2_S    10U
#define CLB_OUTPUT_LUT_4_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_4_FN_S     15U
#define CLB_OUTPUT_LUT_4_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_5 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_5_IN0_S    0U
#define CLB_OUTPUT_LUT_5_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_5_IN1_S    5U
#define CLB_OUTPUT_LUT_5_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_5_IN2_S    10U
#define CLB_OUTPUT_LUT_5_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_5_FN_S     15U
#define CLB_OUTPUT_LUT_5_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_6 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_6_IN0_S    0U
#define CLB_OUTPUT_LUT_6_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_6_IN1_S    5U
#define CLB_OUTPUT_LUT_6_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_6_IN2_S    10U
#define CLB_OUTPUT_LUT_6_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_6_FN_S     15U
#define CLB_OUTPUT_LUT_6_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_OUTPUT_LUT_7 register
//
//*****************************************************************************
#define CLB_OUTPUT_LUT_7_IN0_S    0U
#define CLB_OUTPUT_LUT_7_IN0_M    0x1FU        // Select value for IN0 of
                                               // output LUT
#define CLB_OUTPUT_LUT_7_IN1_S    5U
#define CLB_OUTPUT_LUT_7_IN1_M    0x3E0U       // Select value for IN1 of
                                               // output LUT
#define CLB_OUTPUT_LUT_7_IN2_S    10U
#define CLB_OUTPUT_LUT_7_IN2_M    0x7C00U      // Select value for IN2 of
                                               // output LUT
#define CLB_OUTPUT_LUT_7_FN_S     15U
#define CLB_OUTPUT_LUT_7_FN_M     0x7F8000U    // Output function for output
                                               // LUT

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_HLC_EVENT_SEL register
//
//*****************************************************************************
#define CLB_HLC_EVENT_SEL_EVENT0_SEL_S  0U
#define CLB_HLC_EVENT_SEL_EVENT0_SEL_M  0x1FU        // Event Select 0
#define CLB_HLC_EVENT_SEL_EVENT1_SEL_S  5U
#define CLB_HLC_EVENT_SEL_EVENT1_SEL_M  0x3E0U       // Event Select 1
#define CLB_HLC_EVENT_SEL_EVENT2_SEL_S  10U
#define CLB_HLC_EVENT_SEL_EVENT2_SEL_M  0x7C00U      // Event Select 2
#define CLB_HLC_EVENT_SEL_EVENT3_SEL_S  15U
#define CLB_HLC_EVENT_SEL_EVENT3_SEL_M  0xF8000U     // Event Select 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LOAD_EN register
//
//*****************************************************************************
#define CLB_LOAD_EN_LOAD_EN       0x1U         // Load Enable
#define CLB_LOAD_EN_GLOBAL_EN     0x2U         // Global Enable
#define CLB_LOAD_EN_STOP          0x4U         // Debug stop control

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LOAD_ADDR register
//
//*****************************************************************************
#define CLB_LOAD_ADDR_ADDR_S      0U
#define CLB_LOAD_ADDR_ADDR_M      0x3FU        // Indirect Address

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_INPUT_FILTER register
//
//*****************************************************************************
#define CLB_INPUT_FILTER_FIN0_S   0U
#define CLB_INPUT_FILTER_FIN0_M   0x3U         // Input filter control 0
#define CLB_INPUT_FILTER_FIN1_S   2U
#define CLB_INPUT_FILTER_FIN1_M   0xCU         // Input filter control 1
#define CLB_INPUT_FILTER_FIN2_S   4U
#define CLB_INPUT_FILTER_FIN2_M   0x30U        // Input filter control 2
#define CLB_INPUT_FILTER_FIN3_S   6U
#define CLB_INPUT_FILTER_FIN3_M   0xC0U        // Input filter control 3
#define CLB_INPUT_FILTER_FIN4_S   8U
#define CLB_INPUT_FILTER_FIN4_M   0x300U       // Input filter control 4
#define CLB_INPUT_FILTER_FIN5_S   10U
#define CLB_INPUT_FILTER_FIN5_M   0xC00U       // Input filter control 5
#define CLB_INPUT_FILTER_FIN6_S   12U
#define CLB_INPUT_FILTER_FIN6_M   0x3000U      // Input filter control 6
#define CLB_INPUT_FILTER_FIN7_S   14U
#define CLB_INPUT_FILTER_FIN7_M   0xC000U      // Input filter control 7
#define CLB_INPUT_FILTER_SYNC0    0x10000U     // Synchronizer control 0
#define CLB_INPUT_FILTER_SYNC1    0x20000U     // Synchronizer control 1
#define CLB_INPUT_FILTER_SYNC2    0x40000U     // Synchronizer control 2
#define CLB_INPUT_FILTER_SYNC3    0x80000U     // Synchronizer control 3
#define CLB_INPUT_FILTER_SYNC4    0x100000U    // Synchronizer control 4
#define CLB_INPUT_FILTER_SYNC5    0x200000U    // Synchronizer control 5
#define CLB_INPUT_FILTER_SYNC6    0x400000U    // Synchronizer control 6
#define CLB_INPUT_FILTER_SYNC7    0x800000U    // Synchronizer control 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_IN_MUX_SEL_0 register
//
//*****************************************************************************
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_0  0x1U         // Select GP register 0
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_1  0x2U         // Select GP register 1
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_2  0x4U         // Select GP register 2
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_3  0x8U         // Select GP register 3
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_4  0x10U        // Select GP register 4
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_5  0x20U        // Select GP register 5
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_6  0x40U        // Select GP register 6
#define CLB_IN_MUX_SEL_0_SEL_GP_IN_7  0x80U        // Select GP register 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LCL_MUX_SEL_1 register
//
//*****************************************************************************
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_0_S  0U
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_0_M  0x1FU        // Local Mux select 0
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_1_S  5U
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_1_M  0x3E0U       // Local Mux select 1
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_2_S  10U
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_2_M  0x7C00U      // Local Mux select 2
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_3_S  15U
#define CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_3_M  0xF8000U     // Local Mux select 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LCL_MUX_SEL_2 register
//
//*****************************************************************************
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_4_S  0U
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_4_M  0x1FU        // Local Mux select 4
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_5_S  5U
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_5_M  0x3E0U       // Local Mux select 5
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_6_S  10U
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_6_M  0x7C00U      // Local Mux select 6
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_7_S  15U
#define CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_7_M  0xF8000U     // Local Mux select 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_BUF_PTR register
//
//*****************************************************************************
#define CLB_BUF_PTR_PULL_S        0U
#define CLB_BUF_PTR_PULL_M        0xFFU        // Data pointer for pull
#define CLB_BUF_PTR_PUSH_S        16U
#define CLB_BUF_PTR_PUSH_M        0xFF0000U    // Data pointer for pull

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_GP_REG register
//
//*****************************************************************************
#define CLB_GP_REG_REG_S          0U
#define CLB_GP_REG_REG_M          0xFFU        // General Purpose bit register

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_GLBL_MUX_SEL_1 register
//
//*****************************************************************************
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_0_S  0U
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_0_M  0x7FU        // Global Mux select 0
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_1_S  7U
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_1_M  0x3F80U      // Global Mux select 1
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_2_S  14U
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_2_M  0x1FC000U    // Global Mux select 2
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_3_S  21U
#define CLB_GLBL_MUX_SEL_1_GLBL_MUX_SEL_IN_3_M  0xFE00000U   // Global Mux select 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_GLBL_MUX_SEL_2 register
//
//*****************************************************************************
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_4_S  0U
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_4_M  0x7FU        // Global Mux select 4
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_5_S  7U
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_5_M  0x3F80U      // Global Mux select 5
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_6_S  14U
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_6_M  0x1FC000U    // Global Mux select 6
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_7_S  21U
#define CLB_GLBL_MUX_SEL_2_GLBL_MUX_SEL_IN_7_M  0xFE00000U   // Global Mux select 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_INTR_TAG_REG register
//
//*****************************************************************************
#define CLB_INTR_TAG_REG_TAG_S    0U
#define CLB_INTR_TAG_REG_TAG_M    0x3FU        // Interrupt tag

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_LOCK register
//
//*****************************************************************************
#define CLB_LOCK_LOCK             0x1U         // LOCK enable
#define CLB_LOCK_KEY_S            16U
#define CLB_LOCK_KEY_M            0xFFFF0000U  // Key for enabling write

//*****************************************************************************
//
// The following are defines for the bit fields in the CLB_DBG_OUT register
//
//*****************************************************************************
#define CLB_DBG_OUT_COUNT0_MATCH2  0x2U         // COUNT_MATCH2 UNIT 0
#define CLB_DBG_OUT_COUNT0_ZERO   0x4U         // COUNT_ZERO UNIT 0
#define CLB_DBG_OUT_COUNT0_MATCH1  0x8U         // COUNT_MATCH1 UNIT 0
#define CLB_DBG_OUT_FSM0_S0       0x10U        // FSM_S0 UNIT 0
#define CLB_DBG_OUT_FSM0_S1       0x20U        // FSM_S1 UNIT 0
#define CLB_DBG_OUT_FSM0_LUTOUT   0x40U        // FSM_LUT_OUT UNIT 0
#define CLB_DBG_OUT_LUT40_OUT     0x80U        // LUT4_OUT UNIT 0
#define CLB_DBG_OUT_COUNT1_MATCH2  0x200U       // COUNT_MATCH2 UNIT 1
#define CLB_DBG_OUT_COUNT1_ZERO   0x400U       // COUNT_ZERO UNIT 1
#define CLB_DBG_OUT_COUNT1_MATCH1  0x800U       // COUNT_MATCH1 UNIT 1
#define CLB_DBG_OUT_FSM1_S0       0x1000U      // FSM_S0 UNIT 1
#define CLB_DBG_OUT_FSM1_S1       0x2000U      // FSM_S1 UNIT 1
#define CLB_DBG_OUT_FSM1_LUTOUT   0x4000U      // FSM_LUT_OUT UNIT 1
#define CLB_DBG_OUT_LUT41_OUT     0x8000U      // LUT4_OUT UNIT 1
#define CLB_DBG_OUT_COUNT2_MATCH2  0x20000U     // COUNT_MATCH2 UNIT 2
#define CLB_DBG_OUT_COUNT2_ZERO   0x40000U     // COUNT_ZERO UNIT 2
#define CLB_DBG_OUT_COUNT2_MATCH1  0x80000U     // COUNT_MATCH1 UNIT 2
#define CLB_DBG_OUT_FSM2_S0       0x100000U    // FSM_S0 UNIT 2
#define CLB_DBG_OUT_FSM2_S1       0x200000U    // FSM_S1 UNIT 2
#define CLB_DBG_OUT_FSM2_LUTOUT   0x400000U    // FSM_LUT_OUT UNIT 2
#define CLB_DBG_OUT_LUT42_OUT     0x800000U    // LUT4_OUT UNIT 2
#define CLB_DBG_OUT_OUT0          0x1000000U   // CELL Output 0
#define CLB_DBG_OUT_OUT1          0x2000000U   // CELL Output 1
#define CLB_DBG_OUT_OUT2          0x4000000U   // CELL Output 2
#define CLB_DBG_OUT_OUT3          0x8000000U   // CELL Output 3
#define CLB_DBG_OUT_OUT4          0x10000000U  // CELL Output 4
#define CLB_DBG_OUT_OUT5          0x20000000U  // CELL Output 5
#define CLB_DBG_OUT_OUT6          0x40000000U  // CELL Output 6
#define CLB_DBG_OUT_OUT7          0x80000000U  // CELL Output 7
#endif
